app/Http/Controllers/V1/Admin/AdminController.php

select * from `transactions` where `customer_id` = 22 limit 14 offset 0
select sum(`amount`) as aggregate from `transactions` where `customer_id` = 22
select * from `requests` where `customer_id` = 22
select sum(`amount`) as aggregate from `requests` where `customer_id` = 22
select count(*) as aggregate from `users` where MONTH(created_at) = '01' and `users`.`deleted_at` is null
select count(*) as aggregate from `transactions` where `trx_type` = 1 and MONTH(created_at) = '01'
select count(*) as aggregate from `transactions` where `trx_type` = 0 and MONTH(created_at) = '01'
---
    public function home(){
        if(Auth::user()->access =='user')
        {
            //var_dump(Auth::user()->id);die;
            $contributions = Transaction::where('customer_id', Auth::user()->id)->orderBy('id', 'desc')->paginate(14);
            $withdrawal = PublicRequest::where('customer_id', Auth::user()->id)->orderBy('id', 'desc')->get();
            $total = Transaction::where('customer_id', Auth::user()->id)->sum('amount');
            $totalWithdraw = PublicRequest::where('customer_id', Auth::user()->id)->sum('amount');
            $bankinfo = Bankaccount::where('user_id', Auth::user()->id)->get();
            return view('customer.home.index')
                                                ->with('bankacc', $bankinfo)
                                                ->with('cons', $contributions)
                                                ->with('withdraws', $withdrawal)
                                                ->with('total', $total)
                                                ->with('totalwithdraw', $totalWithdraw);
        }
        else
        {
            /* This section is responsible for Charts */
            $months = [];
            for ($m=1; $m<=12; $m++) {
                $months[] = date('m', mktime(0,0,0,$m, 1, date('Y')));

            }
            $MonthlyRegisteredUsers = [];
            $strMonth = [];
            $monthlyContribution = [];
            $monthlyWithdrawal = [];
            foreach ($months as $month) {
                $MonthlyRegisteredUsers[] = User::whereRaw('MONTH(created_at) = ?', $month)->count();
                $monthlyContribution[] = Transaction::where('trx_type', true)->whereRaw('MONTH(created_at) = ?', $month)->count();
                $monthlyWithdrawal[] = Transaction::where('trx_type', false)->whereRaw('MONTH(created_at) = ?', $month)->count();

select * from `users` where `access` = 'agent' and `users`.`deleted_at` is null
select sum(`amount`) as aggregate from `transactions` where `agent_id` = 2
select count(*) as aggregate from `transactions` where `trx_type` = 0
select count(*) as aggregate from `users` where `access` = 'user' and `users`.`deleted_at` is null
select sum(`amount`) as aggregate from `transactions` where `trx_type` = 1
---

            $totalAgent = [];
            $agentName = [];
            foreach (User::whereAccess('agent')->get() as $agent)
            {
                $totalAgent[] = Transaction::whereAgentId($agent->id)->sum('amount');
                $agentName[] = $agent->name;
            }
            /*  */
            return view('admin.home.index', [
                'users' => User::whereAccess('user')->count(),
                'agents' => User::whereAccess('agent')->count(),
                'transations'   =>  Transaction::whereTrxType(true)->sum('amount'),
                'withdraws'     =>  Transaction::whereTrxType(false)->sum('amount'),
                'monthlyRegisteredUsers' => $MonthlyRegisteredUsers,
                'months'    =>  $strMonth,
                'trxContData' => $monthlyContribution,
                'trxWithData' => $monthlyWithdrawal,
                'agentsMoneyCollectionData' => $totalAgent,
                'agentsMoneyCollection' => $agentName,
            ]);