app/Http/Controllers/V1/Public/PagesController.php

select * from `transactions`
select * from `users` where `users`.`deleted_at` is null
---
    public function home(){
        $trxVol = Transaction::all()->sum('amount');
        $usersTotal = User::all()->count();
        $array = ['trxvol'=>$trxVol, 'totalusers'=>$usersTotal];
        return view('pages.home.index')->with('stats', $array);