app/Models/User.php

    public function totaContribution($id){
        return Transaction::where('customer_id', $id)->sum('amount');
---
select sum(`amount`) as aggregate from `transactions` where `customer_id` = 150

    public function mybalance($id){
        return Transaction::where('customer_id', $id)->sum('amount') - Request::where('customer_id', $id)->where('approved', 1)->sum('amount');
---
select sum(`amount`) as aggregate from `requests` where `customer_id` = 150 and `approved` = 1