app/Providers/ViewServiceProvider.php

    public function boot()
    {
        View::composer('*', function($view){
            if(Auth::check()){
                $user = User::find(Auth::user()->id);
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1